package HW5;

import java.util.HashMap;
import java.util.Map;

public class task1 {
    
    public static void main(String[] args) {
        HashMap<String, String> map = new HashMap<>(Map.of(
            "+79159151515", "Иванов Иван", 
            "+79859858585", "Иванов Иван",
            "+79159151516", "Светлана Петрова", 
            "+79859858587", "Кристина Белова",
            "+79159151511", "Анна Крутова", 
            "+79859858582", "Иван Юрин",
            "+78888888888", "Петр Лыков",
            "+79999999999", "Павел Чернов",
            "+72222222222", "Петр Чернышев",
            "+711111111111", "Мария Федорова",
            "+73333333333",

        ));
    }
}
